project/app/controllers/beers_controller.rb

  def update
    if @beer.update_attributes(permitted_params)
---
UPDATE `beers` SET `price` = 65.0 WHERE `beers`.`id` = 36

  def destroy
    @beer.destroy
---
DELETE FROM `beers` WHERE `beers`.`id` = 36

  def load_beer
    @beer = Beer.find(params[:id])
---
SELECT  `beers`.* FROM `beers` WHERE `beers`.`id` = 36 LIMIT 1