project/app/controllers/providers_controller.rb

  def create
    @provider = Provider.create(permitted_params)
---
INSERT INTO `providers` (`contact_email`, `contact_phone`, `name`, `created_at`, `updated_at`) VALUES ('xd@gmail.com', '(21) 3344-5544', 'Xd', '2018-03-29 14:04:48', '2018-03-29 14:04:48')

  def update
    if @provider.update_attributes(permitted_params)
---
UPDATE `providers` SET `contact_email` = 'fornecedor_001@gmail.com', `updated_at` = '2018-03-29 14:06:25' WHERE `providers`.`id` = 1

  def destroy
    @provider.destroy
---
DELETE FROM `providers` WHERE `providers`.`id` = 1

  def load_provider
    @provider = Provider.find(params[:id])
---
SELECT  `providers`.* FROM `providers` WHERE `providers`.`id` = 1 LIMIT 1