project/app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `number`, `address`, `state`, `city`) VALUES ('novo usuario', 'novo.usuario@gmail.com', 678, '688 Jaylan Lodge, West Marion, ME 95890-0049', 'ME', 'Sei la')
---
  def create
    @user = User.create(permitted_params)

UPDATE `users` SET `city` = 'West Johnview lalallaa' WHERE `users`.`id` = 1
---
  def update
    if @user.update_attributes(permitted_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def load_user
    @user = User.find_by(id: params[:id])