project/app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 50
---
  def index
    @users = User.limit(50)

SELECT  `users`.`id`, `users`.`name`, `users`.`email` FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @user = User.select(:name, :email).find_by(id: params[:id])